# GetFldType

## Description
Returns a constant indicating the data type of a specified field in the referenced record.

Please refer to the Script Appendix for specific field data types and formatting.

For Plug-in Object Parameter Records, the field types are documented in the Scirpt Appendix.

```pascal
FUNCTION GetFldType(
				h : HANDLE;
				t : INTEGER): INTEGER;
```

```python
def vs.GetFldType(h, t):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to record.|
|t|INTEGER|Field index (range of 1 - n).|

## Remarks
Returns a constant indicating which type of field is specified by the field number &quot;t&quot; of record &quot;h&quot;.  The field type constants are listed in an appendix in the vectorscript manual.

In the appendix, the field types for worksheets and data records are listed, but the field types for parameter records (e.g., plug-in object records) are different...

Data Records:

| Constant | Description                |
|----------|---------------------------|
| 1        | Integer                   |
| 2        | Boolean                   |
| 3        | Number-general            |
| 4        | Text                      |
| 5        | Number-decimal            |
| 6        | Number-decimal w/ commas  |
| 7        | Number-scientific         |
| 8        | Number-fractional         |
| 9        | Number-dimension          |
| 10       | Number-angle              |
| 11       | Number-date/time          |

PIO Records:

| Constant | Description         |
|----------|--------------------|
| 1        | Integer            |
| 2        | Boolean            |
| 3        | Number             |
| 4        | Text               |
| 7        | Dimension          |
| 8        | Pop-Up             |
| 9        | Radio Buttons      |
| 10       | Control Point X    |
| 11       | Control Point Y    |
| 14       | Static Text Label  |
| 18       | Classes Pop-up     |
| 19       | Layer Pop-up       |
| 20       | Angle              |
| 21       | Area               |
| 22       | Volume             |
| 23       | Class              |
| 24       | Material           |
| 25       | Fill               |
| 26       | Pen Style          |
| 27       | Pen Weight         |
| 28       | Color              |
| 29       | Texture            |
| 30       | Symbol Definition  |

## Examples
#### VectorScript ####
```pascal
fieldType:=GetFldType(recordHandle,3);
```
#### Python ####
```python
fieldType = vs.GetFldType(recordHandle,3)
```

```pascal
	PopSub2;
END;
for i := 1 to NumFields(recHandle) do BEGIN
	if GetFldName(recHandle, i) = fieldVa then BEGIN
		fldType := Int2Str(GetFldType(recHandle, i));
		IF isPIO
			THEN fldType := Concat('p', fldType)
			ELSE fldType := Concat('r', fldType);
	END;

HRec := GetRecord(HObject,i);
RecName := GetName(HRec);
NumFld := NumFields(HRec);
FOR j := 1 to NumFld DO BEGIN
	typeflag := GetFldType(HRec,j);
	IF (typeflag = 4) THEN BEGIN {work only on strings}
		Fldname := GetFldName(HRec,j);
		FldStr := GetRField(HObject,RecName,FldName);
		IF ((Len(FldStr) > 0)&(FindString(FldStr,gFindString,1,gCase) > 0)) THEN

BEGIN
	fldType := GetFldType(recHand, ndx);
	uniName := GetFldName(recHand, ndx);
	locName := uniName;
	isHid := FALSE;
	if (IsPlugInFormat(recHand)) & (GetLocalizedPluginParameter(GetName(recHand), uniName, locName)) then BEGIN
```
```python
import vs

# Returns a constant indicating the data type of a specified field in the
# referenced record.
h = vs.FSActLayer()  # handle to the first selected object on the active layer
t = 1

resultN = vs.GetFldType(h, t)
vs.Message('GetFldType returned: ' + str(resultN))
```

## Version
Availability: from All Versions

## Category
* Database @ Record